tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nektos/tap"
tap "rcmdnk/rcmdnkpac"
tap "sanemat/font"

brew "anyenv"
brew "awscli"
brew "cocoapods"
brew "direnv"
brew "fd"
brew "fzf"
brew "ghq"
brew "git"
brew "git-now"
brew "jq"
brew "mackup"
brew "macvim"
brew "mas"
brew "mecab"
brew "mysql-client@5.7"
brew "redis"
brew "ripgrep"
brew "rmtrash"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "nektos/tap/act"
brew "sanemat/font/ricty", args: ["with-powerline"]

cask_args appdir: "eApplications"
cask "alfred"
cask "appcleaner"
cask "deepl"
cask "docker"
cask "dropbox"
cask "google-japanese-ime"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "ngrok"
cask "notion"
cask "shiftit"
cask "trailer"

mas "LINE", id: 539883307
mas "PicGIF Lite", id: 844918735
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Mate Translate", id: 1005088137
