tap "homebrew/cask-fonts"

brew "act"
brew "alfred"
brew "awscli"
brew "bat"
brew "colordiff"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-now"
brew "grep"
brew "jq"
brew "mackup"
brew "macvim"
brew "mas"
brew "mise"
brew "nkf"
brew "pango"
brew "pstree"
brew "rename"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"

cask_args appdir: "~/Applications"
cask "appcleaner"
cask "deepl"
cask "docker"
cask "dropbox"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "moom"
cask "notion"
cask "zoom"

mas "LINE", id: 539883307
mas "PicGIF Lite", id: 844918735
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Spark Mail", id: 997102246
mas "Messenger", id: 454638411


